{"class_name": "Model", "config": {"name": "model_17", "layers": [{"name": "postMedia_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 5, 5, 1536], "dtype": "float32", "sparse": false, "name": "postMedia_input"}, "inbound_nodes": []}, {"name": "postText_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 50], "dtype": "int32", "sparse": false, "name": "postText_input"}, "inbound_nodes": []}, {"name": "targetDescription_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "int32", "sparse": false, "name": "targetDescription_input"}, "inbound_nodes": []}, {"name": "targetKeywords_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "int32", "sparse": false, "name": "targetKeywords_input"}, "inbound_nodes": []}, {"name": "targetParagraphs_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500], "dtype": "int32", "sparse": false, "name": "targetParagraphs_input"}, "inbound_nodes": []}, {"name": "targetTitle_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 50], "dtype": "int32", "sparse": false, "name": "targetTitle_input"}, "inbound_nodes": []}, {"name": "reshape_17", "class_name": "Reshape", "config": {"name": "reshape_17", "trainable": true, "target_shape": [-1]}, "inbound_nodes": [[["postMedia_input", 0, 0, {}]]]}, {"name": "embedding_17", "class_name": "Embedding", "config": {"name": "embedding_17", "trainable": false, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 1070971, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "inbound_nodes": [[["postText_input", 0, 0, {}]], [["targetDescription_input", 0, 0, {}]], [["targetKeywords_input", 0, 0, {}]], [["targetParagraphs_input", 0, 0, {}]], [["targetTitle_input", 0, 0, {}]]]}, {"name": "dense_129", "class_name": "Dense", "config": {"name": "dense_129", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape_17", 0, 0, {}]]]}, {"name": "time_distributed_81", "class_name": "TimeDistributed", "config": {"name": "time_distributed_81", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_130", "trainable": true, "units": 30, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["embedding_17", 0, 0, {}]]]}, {"name": "time_distributed_82", "class_name": "TimeDistributed", "config": {"name": "time_distributed_82", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_131", "trainable": true, "units": 30, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["embedding_17", 1, 0, {}]]]}, {"name": "time_distributed_83", "class_name": "TimeDistributed", "config": {"name": "time_distributed_83", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_132", "trainable": true, "units": 30, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["embedding_17", 2, 0, {}]]]}, {"name": "time_distributed_84", "class_name": "TimeDistributed", "config": {"name": "time_distributed_84", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_133", "trainable": true, "units": 64, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["embedding_17", 3, 0, {}]]]}, {"name": "time_distributed_85", "class_name": "TimeDistributed", "config": {"name": "time_distributed_85", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_134", "trainable": true, "units": 30, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["embedding_17", 4, 0, {}]]]}, {"name": "dropout_33", "class_name": "Dropout", "config": {"name": "dropout_33", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_129", 0, 0, {}]]]}, {"name": "bidirectional_81", "class_name": "Bidirectional", "config": {"name": "bidirectional_81", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_81", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 30, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["time_distributed_81", 0, 0, {}]]]}, {"name": "bidirectional_82", "class_name": "Bidirectional", "config": {"name": "bidirectional_82", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_82", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 30, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["time_distributed_82", 0, 0, {}]]]}, {"name": "bidirectional_83", "class_name": "Bidirectional", "config": {"name": "bidirectional_83", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_83", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 30, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["time_distributed_83", 0, 0, {}]]]}, {"name": "bidirectional_84", "class_name": "Bidirectional", "config": {"name": "bidirectional_84", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_84", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 64, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["time_distributed_84", 0, 0, {}]]]}, {"name": "bidirectional_85", "class_name": "Bidirectional", "config": {"name": "bidirectional_85", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_85", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 30, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["time_distributed_85", 0, 0, {}]]]}, {"name": "concatenate_17", "class_name": "Concatenate", "config": {"name": "concatenate_17", "trainable": true, "axis": -1}, "inbound_nodes": [[["dropout_33", 0, 0, {}], ["bidirectional_81", 0, 0, {}], ["bidirectional_82", 0, 0, {}], ["bidirectional_83", 0, 0, {}], ["bidirectional_84", 0, 0, {}], ["bidirectional_85", 0, 0, {}]]]}, {"name": "dense_135", "class_name": "Dense", "config": {"name": "dense_135", "trainable": true, "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_17", 0, 0, {}]]]}, {"name": "dropout_34", "class_name": "Dropout", "config": {"name": "dropout_34", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_135", 0, 0, {}]]]}, {"name": "dense_136", "class_name": "Dense", "config": {"name": "dense_136", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_34", 0, 0, {}]]]}], "input_layers": [["postMedia_input", 0, 0], ["postText_input", 0, 0], ["targetDescription_input", 0, 0], ["targetKeywords_input", 0, 0], ["targetParagraphs_input", 0, 0], ["targetTitle_input", 0, 0]], "output_layers": [["dense_136", 0, 0]]}, "keras_version": "2.1.6", "backend": "tensorflow", "image_embedding_function": "inception_resnet_v2.InceptionResNetV2"}