{"class_name": "Model", "config": {"name": "model_10", "layers": [{"name": "postMedia_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 5, 5, 1536], "dtype": "float32", "sparse": false, "name": "postMedia_input"}, "inbound_nodes": []}, {"name": "postText_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 50], "dtype": "int32", "sparse": false, "name": "postText_input"}, "inbound_nodes": []}, {"name": "targetDescription_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "int32", "sparse": false, "name": "targetDescription_input"}, "inbound_nodes": []}, {"name": "targetKeywords_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "int32", "sparse": false, "name": "targetKeywords_input"}, "inbound_nodes": []}, {"name": "targetParagraphs_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500], "dtype": "int32", "sparse": false, "name": "targetParagraphs_input"}, "inbound_nodes": []}, {"name": "targetTitle_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 50], "dtype": "int32", "sparse": false, "name": "targetTitle_input"}, "inbound_nodes": []}, {"name": "reshape_10", "class_name": "Reshape", "config": {"name": "reshape_10", "trainable": true, "target_shape": [-1]}, "inbound_nodes": [[["postMedia_input", 0, 0, {}]]]}, {"name": "embedding_10", "class_name": "Embedding", "config": {"name": "embedding_10", "trainable": false, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 1070971, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "inbound_nodes": [[["postText_input", 0, 0, {}]], [["targetDescription_input", 0, 0, {}]], [["targetKeywords_input", 0, 0, {}]], [["targetParagraphs_input", 0, 0, {}]], [["targetTitle_input", 0, 0, {}]]]}, {"name": "dense_73", "class_name": "Dense", "config": {"name": "dense_73", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape_10", 0, 0, {}]]]}, {"name": "time_distributed_46", "class_name": "TimeDistributed", "config": {"name": "time_distributed_46", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_74", "trainable": true, "units": 30, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["embedding_10", 0, 0, {}]]]}, {"name": "time_distributed_47", "class_name": "TimeDistributed", "config": {"name": "time_distributed_47", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_75", "trainable": true, "units": 30, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["embedding_10", 1, 0, {}]]]}, {"name": "time_distributed_48", "class_name": "TimeDistributed", "config": {"name": "time_distributed_48", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_76", "trainable": true, "units": 30, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["embedding_10", 2, 0, {}]]]}, {"name": "time_distributed_49", "class_name": "TimeDistributed", "config": {"name": "time_distributed_49", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_77", "trainable": true, "units": 64, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["embedding_10", 3, 0, {}]]]}, {"name": "time_distributed_50", "class_name": "TimeDistributed", "config": {"name": "time_distributed_50", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_78", "trainable": true, "units": 30, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["embedding_10", 4, 0, {}]]]}, {"name": "dropout_19", "class_name": "Dropout", "config": {"name": "dropout_19", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_73", 0, 0, {}]]]}, {"name": "bidirectional_46", "class_name": "Bidirectional", "config": {"name": "bidirectional_46", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_46", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 30, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["time_distributed_46", 0, 0, {}]]]}, {"name": "bidirectional_47", "class_name": "Bidirectional", "config": {"name": "bidirectional_47", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_47", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 30, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["time_distributed_47", 0, 0, {}]]]}, {"name": "bidirectional_48", "class_name": "Bidirectional", "config": {"name": "bidirectional_48", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_48", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 30, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["time_distributed_48", 0, 0, {}]]]}, {"name": "bidirectional_49", "class_name": "Bidirectional", "config": {"name": "bidirectional_49", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_49", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 64, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["time_distributed_49", 0, 0, {}]]]}, {"name": "bidirectional_50", "class_name": "Bidirectional", "config": {"name": "bidirectional_50", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_50", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 30, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["time_distributed_50", 0, 0, {}]]]}, {"name": "concatenate_10", "class_name": "Concatenate", "config": {"name": "concatenate_10", "trainable": true, "axis": -1}, "inbound_nodes": [[["dropout_19", 0, 0, {}], ["bidirectional_46", 0, 0, {}], ["bidirectional_47", 0, 0, {}], ["bidirectional_48", 0, 0, {}], ["bidirectional_49", 0, 0, {}], ["bidirectional_50", 0, 0, {}]]]}, {"name": "dense_79", "class_name": "Dense", "config": {"name": "dense_79", "trainable": true, "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_10", 0, 0, {}]]]}, {"name": "dropout_20", "class_name": "Dropout", "config": {"name": "dropout_20", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_79", 0, 0, {}]]]}, {"name": "dense_80", "class_name": "Dense", "config": {"name": "dense_80", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_20", 0, 0, {}]]]}], "input_layers": [["postMedia_input", 0, 0], ["postText_input", 0, 0], ["targetDescription_input", 0, 0], ["targetKeywords_input", 0, 0], ["targetParagraphs_input", 0, 0], ["targetTitle_input", 0, 0]], "output_layers": [["dense_80", 0, 0]]}, "keras_version": "2.1.6", "backend": "tensorflow", "image_embedding_function": "inception_resnet_v2.InceptionResNetV2"}