{"class_name": "Model", "config": {"name": "model_25", "layers": [{"name": "postText_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 50], "dtype": "int32", "sparse": false, "name": "postText_input"}, "inbound_nodes": []}, {"name": "targetDescription_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "int32", "sparse": false, "name": "targetDescription_input"}, "inbound_nodes": []}, {"name": "targetKeywords_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "int32", "sparse": false, "name": "targetKeywords_input"}, "inbound_nodes": []}, {"name": "targetParagraphs_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500], "dtype": "int32", "sparse": false, "name": "targetParagraphs_input"}, "inbound_nodes": []}, {"name": "targetTitle_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 50], "dtype": "int32", "sparse": false, "name": "targetTitle_input"}, "inbound_nodes": []}, {"name": "embedding_25", "class_name": "Embedding", "config": {"name": "embedding_25", "trainable": false, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 1070971, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "inbound_nodes": [[["postText_input", 0, 0, {}]], [["targetDescription_input", 0, 0, {}]], [["targetKeywords_input", 0, 0, {}]], [["targetParagraphs_input", 0, 0, {}]], [["targetTitle_input", 0, 0, {}]]]}, {"name": "time_distributed_121", "class_name": "TimeDistributed", "config": {"name": "time_distributed_121", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_169", "trainable": true, "units": 30, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["embedding_25", 0, 0, {}]]]}, {"name": "time_distributed_122", "class_name": "TimeDistributed", "config": {"name": "time_distributed_122", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_170", "trainable": true, "units": 30, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["embedding_25", 1, 0, {}]]]}, {"name": "time_distributed_123", "class_name": "TimeDistributed", "config": {"name": "time_distributed_123", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_171", "trainable": true, "units": 30, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["embedding_25", 2, 0, {}]]]}, {"name": "time_distributed_124", "class_name": "TimeDistributed", "config": {"name": "time_distributed_124", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_172", "trainable": true, "units": 64, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["embedding_25", 3, 0, {}]]]}, {"name": "time_distributed_125", "class_name": "TimeDistributed", "config": {"name": "time_distributed_125", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_173", "trainable": true, "units": 30, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["embedding_25", 4, 0, {}]]]}, {"name": "bidirectional_121", "class_name": "Bidirectional", "config": {"name": "bidirectional_121", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_121", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 30, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["time_distributed_121", 0, 0, {}]]]}, {"name": "bidirectional_122", "class_name": "Bidirectional", "config": {"name": "bidirectional_122", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_122", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 30, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["time_distributed_122", 0, 0, {}]]]}, {"name": "bidirectional_123", "class_name": "Bidirectional", "config": {"name": "bidirectional_123", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_123", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 30, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["time_distributed_123", 0, 0, {}]]]}, {"name": "bidirectional_124", "class_name": "Bidirectional", "config": {"name": "bidirectional_124", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_124", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 64, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["time_distributed_124", 0, 0, {}]]]}, {"name": "bidirectional_125", "class_name": "Bidirectional", "config": {"name": "bidirectional_125", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_125", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 30, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["time_distributed_125", 0, 0, {}]]]}, {"name": "concatenate_25", "class_name": "Concatenate", "config": {"name": "concatenate_25", "trainable": true, "axis": -1}, "inbound_nodes": [[["bidirectional_121", 0, 0, {}], ["bidirectional_122", 0, 0, {}], ["bidirectional_123", 0, 0, {}], ["bidirectional_124", 0, 0, {}], ["bidirectional_125", 0, 0, {}]]]}, {"name": "dense_174", "class_name": "Dense", "config": {"name": "dense_174", "trainable": true, "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_25", 0, 0, {}]]]}, {"name": "dropout_25", "class_name": "Dropout", "config": {"name": "dropout_25", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_174", 0, 0, {}]]]}, {"name": "dense_175", "class_name": "Dense", "config": {"name": "dense_175", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_25", 0, 0, {}]]]}], "input_layers": [["postText_input", 0, 0], ["targetDescription_input", 0, 0], ["targetKeywords_input", 0, 0], ["targetParagraphs_input", 0, 0], ["targetTitle_input", 0, 0]], "output_layers": [["dense_175", 0, 0]]}, "keras_version": "2.1.6", "backend": "tensorflow", "image_embedding_function": null}