{"class_name": "Model", "config": {"name": "model_5", "layers": [{"name": "postMedia_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 5, 5, 1536], "dtype": "float32", "sparse": false, "name": "postMedia_input"}, "inbound_nodes": []}, {"name": "postText_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 50], "dtype": "int32", "sparse": false, "name": "postText_input"}, "inbound_nodes": []}, {"name": "targetDescription_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "int32", "sparse": false, "name": "targetDescription_input"}, "inbound_nodes": []}, {"name": "targetKeywords_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "int32", "sparse": false, "name": "targetKeywords_input"}, "inbound_nodes": []}, {"name": "targetParagraphs_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500], "dtype": "int32", "sparse": false, "name": "targetParagraphs_input"}, "inbound_nodes": []}, {"name": "targetTitle_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 50], "dtype": "int32", "sparse": false, "name": "targetTitle_input"}, "inbound_nodes": []}, {"name": "reshape_10", "class_name": "Reshape", "config": {"name": "reshape_10", "trainable": true, "target_shape": [-1]}, "inbound_nodes": [[["postMedia_input", 0, 0, {}]]]}, {"name": "embedding_5", "class_name": "Embedding", "config": {"name": "embedding_5", "trainable": false, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 1070971, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "inbound_nodes": [[["postText_input", 0, 0, {}]], [["targetDescription_input", 0, 0, {}]], [["targetKeywords_input", 0, 0, {}]], [["targetParagraphs_input", 0, 0, {}]], [["targetTitle_input", 0, 0, {}]]]}, {"name": "image_available_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "image_available_input"}, "inbound_nodes": []}, {"name": "dense_33", "class_name": "Dense", "config": {"name": "dense_33", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape_10", 0, 0, {}]]]}, {"name": "time_distributed_21", "class_name": "TimeDistributed", "config": {"name": "time_distributed_21", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_34", "trainable": true, "units": 30, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["embedding_5", 0, 0, {}]]]}, {"name": "time_distributed_22", "class_name": "TimeDistributed", "config": {"name": "time_distributed_22", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_35", "trainable": true, "units": 30, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["embedding_5", 1, 0, {}]]]}, {"name": "time_distributed_23", "class_name": "TimeDistributed", "config": {"name": "time_distributed_23", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_36", "trainable": true, "units": 30, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["embedding_5", 2, 0, {}]]]}, {"name": "time_distributed_24", "class_name": "TimeDistributed", "config": {"name": "time_distributed_24", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_37", "trainable": true, "units": 64, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["embedding_5", 3, 0, {}]]]}, {"name": "time_distributed_25", "class_name": "TimeDistributed", "config": {"name": "time_distributed_25", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_38", "trainable": true, "units": 30, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["embedding_5", 4, 0, {}]]]}, {"name": "reshape_9", "class_name": "Reshape", "config": {"name": "reshape_9", "trainable": true, "target_shape": [-1]}, "inbound_nodes": [[["image_available_input", 0, 0, {}]]]}, {"name": "dropout_9", "class_name": "Dropout", "config": {"name": "dropout_9", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_33", 0, 0, {}]]]}, {"name": "bidirectional_21", "class_name": "Bidirectional", "config": {"name": "bidirectional_21", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_21", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 30, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["time_distributed_21", 0, 0, {}]]]}, {"name": "bidirectional_22", "class_name": "Bidirectional", "config": {"name": "bidirectional_22", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_22", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 30, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["time_distributed_22", 0, 0, {}]]]}, {"name": "bidirectional_23", "class_name": "Bidirectional", "config": {"name": "bidirectional_23", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_23", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 30, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["time_distributed_23", 0, 0, {}]]]}, {"name": "bidirectional_24", "class_name": "Bidirectional", "config": {"name": "bidirectional_24", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_24", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 64, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["time_distributed_24", 0, 0, {}]]]}, {"name": "bidirectional_25", "class_name": "Bidirectional", "config": {"name": "bidirectional_25", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_25", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 30, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["time_distributed_25", 0, 0, {}]]]}, {"name": "concatenate_5", "class_name": "Concatenate", "config": {"name": "concatenate_5", "trainable": true, "axis": -1}, "inbound_nodes": [[["reshape_9", 0, 0, {}], ["dropout_9", 0, 0, {}], ["bidirectional_21", 0, 0, {}], ["bidirectional_22", 0, 0, {}], ["bidirectional_23", 0, 0, {}], ["bidirectional_24", 0, 0, {}], ["bidirectional_25", 0, 0, {}]]]}, {"name": "dense_39", "class_name": "Dense", "config": {"name": "dense_39", "trainable": true, "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_5", 0, 0, {}]]]}, {"name": "dropout_10", "class_name": "Dropout", "config": {"name": "dropout_10", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_39", 0, 0, {}]]]}, {"name": "dense_40", "class_name": "Dense", "config": {"name": "dense_40", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_10", 0, 0, {}]]]}], "input_layers": [["image_available_input", 0, 0], ["postMedia_input", 0, 0], ["postText_input", 0, 0], ["targetDescription_input", 0, 0], ["targetKeywords_input", 0, 0], ["targetParagraphs_input", 0, 0], ["targetTitle_input", 0, 0]], "output_layers": [["dense_40", 0, 0]]}, "keras_version": "2.1.6", "backend": "tensorflow", "image_embedding_function": "inception_resnet_v2.InceptionResNetV2"}